# ЗАДАНИЕ 13.8.19
print('--------------------------------------------------------------------------------\n'
      'Данная программа производит расчёт стоимости билетов на онлайн-конференцию.\n'
      'Стоимость билета зависит от возраста'
      'учасника и количества покупаемых билетов.\n'
      '--------------------------------------------------------------------------------\n')
count_tickets = input('Укажите количество приобретаемых билетов: ')
# Возраст каждого билета
ticket_age = {}
for i in range(int(count_tickets)):
      ticket_age[i] = int(input('Введите возраст ' + str(i+1) + 'го билета: '))
# Кол-во билетов
childlike = 0
youth = 0
adult = 0
# Цены
all_tickets = {}
for i in ticket_age:
      if -1 < ticket_age[i] < 18:
            all_tickets[i] = 0
            childlike += 1
      elif 17 < ticket_age[i] < 26:
            all_tickets[i] = 990
            youth += 1
      elif 25 < ticket_age[i]:
            all_tickets[i] = 1390
            adult += 1
      else:
            all_tickets[i] = 0
            childlike += 1
print ()
print ()
# Расчёт стоимости
print('Расчёт стоимости билетов\n'
      '--------------------------------------------------------------------------------')
print('Всего билетов: ' + str(count_tickets) + ' шт.')
print('--------------------------------------------------------------------------------')
print("Из них:")
if childlike > 0:
      print("Детских: " + str(childlike) + ' шт. Цена: '+ str(0) + ' руб.')
if youth > 0:
      print("Молодежных: " + str(youth) + ' шт. Цена: '+ str(youth*990) + ' руб.')
if adult > 0:
      print("Взрослых: " + str(adult) + ' шт. Цена: '+ str(adult*1390) + ' руб.')
print('--------------------------------------------------------------------------------\n')
value = sum(all_tickets.values())
print('ВСЕГО: ' + str(value) + ' руб.')
# СКИДКА
if (childlike + youth + adult) > 2:
      value = int(value - (value * 10 / 100))
      print('Ваша скидка составляет 10%')
      print('Цена с учётом скидки: ' + str(value) + ' руб.')
